<script>
import Banner from '../components/Banner.vue';
import FlyingText from '../components/FlyingText.vue';
import Gallery from '../components/Gallery.vue';
import Program from '../components/Program.vue';
import Variants from '../components/Variants.vue';
import { results } from '../assets/results.json';

export default {
	data() {
		return {

		}
	},
	head() {
		return {
			title: 'Курс "Твоя Вселенная"',
			meta: [ 
				{ name: 'og:title', content: 'Курс "Твоя Вселенная' }, 
				{ name: 'og:description', content: 'Авторский курс по созданию своего собственного мира. У каждого внутри есть своя вселенная. Как выглядит твоя?' }, 
				{ name: 'og:site_name', content: 'Твоя вселенная'},
				{ name: 'og:url', content: 'https://apersonaluniverse.netlify.app/course'},
			],
		}
	},
	components: {
		Banner,
		FlyingText,
		Gallery,
		Program,
		Variants
	},
	mounted() {

	},
	computed: {
		images() {
			return results
				.filter(result => result.image !== 'your-own')
				.map(result => { return { image: result.image, url: result.url, urlText: result.urlText } });
		},
		testimonials() {
			return [
				
				{image: 'lera'},
				{image: 'katyi'},
				{image: 'natasha'},
				{
					image: 'polina'
				},
				
				{image: 'katya'},
				{image: 'masha'},
				{image: 'nata'},
				{image: 'masha2'},
				{image: 'natavol'}
			]
		}
	},
	methods: {

	}
}
</script>

<template>
	<Banner image="banner">
		<h1>Твоя Вселенная</h1>
		<h2>У каждого внутри есть своя Вселенная.<br>Как выглядит <em>твоя</em>?</h2>
		<a href="https://forms.gle/JEdn86QVGE4yJrww6" target="_blank" class="button">Записаться на курс</a>
		<p><em>Старт нового потока в середине мая!</em></p>
	</Banner>

	<FlyingText>
		<p>Мы зовем вас в путешествие по неизведанным землям — по вашим собственным мирам, которые уже живут внутри и ждут,
			чтобы проявиться.</p>
		<p>Это не курс по рисованию или писательству. Мы не будем учить вас творить “правильно”. Но мы щедро поделимся своим
			опытом, направим и вдохновим. Наша цель — не научить вас рисовать и писать, а показать, как можно использовать
			эти виды творчества вместе, чтобы бережно достать из себя свой мир и рассказать о нем.</p>
			
	</FlyingText>

	<Gallery :images="images" heading="Кусочки Вселенных наших участников"></Gallery>

	<FlyingText>
		<p>В конце каждого блока курса вас ждут два основных задания — на рисунок и на текст, — которые помогут вам раскрыть
			частичку новой Вселенной. А мы создадим для вас безопасное творческое пространство, где вы почувствуете
			поддержку и тепло.</p>

		<p>По итогу итогу курса вы создадите 4 рисунка и 4 текста, но это еще не все! Вы унесёте с собой кирпичики нового,
			вашего собственного мира, и все инструменты и методы, чтобы строить этот мир и дальше. Кирпичики складываются, и
			вас накрывает ощущение легкого опьянения — наверное, так чувствуют себя Демиурги, когда в их руках рождаются
			новые Вселенные…</p>
	</FlyingText>

	<Variants heading="Варианты участия в курсе"></Variants>

	<FlyingText>
		<h3>План нашего путешествия</h3>

		<h4>Блок 0: Слет Странников</h4>
		<p>Собираемся, знакомимся и замираем перед длинным путешествием</p>

		<h4>Блок 1: Начало Путешествия</h4>
		<p>Рефлексируем и начинаем строить мир от себя.<br>
			В этом блоке вы поймете, какой мир хотите создать, и прочувствуете, каково это — быть его жителем</p>



		<h4>Блок 2: Осмотр достопримечательностей</h4>
		<p>Создаем первую локацию вашего мира<br>
			На этой неделе вы научитесь генерировать разные локации, которые путешественник мог бы посетить в вашем мире, и
			расскажете об одной из них. Подводим промежуточные результаты.</p>

		<p><em>Для тарифа Волшебник: Разрабатываем сюжет, чтобы наши истории обрели структуру и логику.</em></p>

		<h4>Блок 3: Знакомство с местными жителями</h4>
		<p>Населяем ваш мир существами<br>
			На этой неделе речь пойдет о персонажах. Вы поймете, кто живет в вашем мире, как они выглядят, как чувствуют и
			действуют, и перенесете их на бумагу (или на планшет :))</p>

		<p><em>Для тарифа Волшебник: Подробно разбираем характер и историю главного персонажа — героя, который отправляется
				в путешествие.</em></p>

		<h4>Блок 4: Полет на облаке</h4>
		<p>Смотрим на мир свысока и рисуем его карту<br>
			На этой неделе вы расскажете об истории своего мира и подготовите почву для его дальнейшего развития.</p>

		<p><em>Для тарифа Волшебник: Продумываем и во всех деталях создаём одну из сцен, которую прописывали в сюжете.</em>
		</p>

		<h4>Разбор фотокарточек:</h4>
		<p>Собираем свой опыт в презентацию<br>
			В конце у вас будет уже солидный фундамент для дальнейшего развития своего мира. Вы соберете все, что вы делали,
			в презентацию и расскажете о своей Вселенной на финальном созвоне 🔥</p>
			<div class="links">
		<a href="https://forms.gle/JEdn86QVGE4yJrww6" target="_blank" class="button">Записаться на курс</a>
	</div>
	
		</FlyingText>

		<Gallery :images="testimonials" heading="Отзывы наших выпускников"></Gallery>

	<!-- <Program></Program> -->
</template>

<style scoped lang="scss">
.links {
	.button {
		margin-top: 0;
	}
}
</style>